// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   ConnectStrings.uni
// 
// Abstract:
// 
//   String definitions for commands 'connect' and 'reconnect'
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"

#string STR_SHELLENV_CONNECT_HANDLE_ERR #language eng  "%hs: %hx is not a %s handle.\n"

#string STR_SHELLENV_CONNECT_CONNECT_CONTROLLER #language eng  "ConnectController(%hx) : "

#string STR_SHELLENV_CONNECT_STATUS    #language eng  "Status = %r\n"

#string STR_SHELLENV_CONNECT_FAIL      #language eng  "%Hconnect:%N Can not connect %hx to %hx.\n"

#string STR_SHELLENV_CONNECT_CONNECT_CONTROLLER_2 #language eng  "ConnectController(%hx, %hx) : "

#string STR_SHELLENV_CONNECT_DISC_DEVICE_PATH_PROTOCOL #language eng  "%hs: Device Path Protocols not found\n"

#string STR_SHELLENV_CONNECT_DISC_CONTROLLER #language eng  "%hs(%hx,%hx,%hx) : Status = %r\n"

#string STR_SHELLENV_CONNECT_REC_CONTROLLER #language eng  "ReconnectController(%hx,%hx,%hx) : Status = %r\n"

#string STR_SHELLENV_CONNECT_REC_CONFLICT #language eng  "%hs: Flag '%H-r%N' conflicted with other arguments\n"

#string STR_SHELLENV_CONNECT_LINE_HELP  #language eng  "Binds an EFI driver to a device and starts the driver"

#string STR_SHELLENV_CONNECT_VERBOSE_HELP #language eng "Binds an EFI driver to a device and starts the driver.\n"
                                                      "\n"
                                                      "CONNECT [[DeviceHandle] [DriverHandle] | [-c] | [-r]]\n"
                                                      "\n"
                                                      "    -r              - Connect recursively\n"
                                                      "    -c              - Connect console devices described in the EFI Environment\n"
                                                      "                      Variables\n"
                                                      "    DeviceHandle    - Device handle, always taken as hexadecimal number\n"
                                                      "    DriverHandle    - Driver handle, always taken as hexadecimal number\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. When option '-c' is specified, only console devices described in the\n"
                                                      "       EFI Environment Variables and related devices will be connected.\n"
                                                      "    2. If recursive option '-r' is specified, it causes EFI to scan all\n"
                                                      "       handles and checks to see if any loaded or embedded driver can match\n"
                                                      "       the specified device. If so, the driver will be bound to the device.\n"
                                                      "       Additionally, if more device handles are created during the binding, \n"
                                                      "       these handles will also be checked to see if a matching driver can bind \n"
                                                      "       to these devices as well. The process is repeated until no more drivers\n"
                                                      "       are able to connect to any devices. However, if without the option,\n"
                                                      "       the newly created device handles will not be further bound to any\n"
                                                      "       drivers.\n"
                                                      "    3. If no 'DriverHandle' parameter is specified, all matched drivers\n"
                                                      "       will be bound to the specified device.\n"
                                                      "    4. If no 'DeviceHandle' parameter is specified, all device handles in\n"
                                                      "       the current system will be the default.\n"
                                                      "    5. If only a single handle is specified and the handle has an\n"
                                                      "       EFI_DRIVER_BINDING_PROTOCOL on it, then the handle is assumed\n"
                                                      "       to be a driver handle.  Otherwise, it is assumed to be a device handle.\n"
                                                      "    6. If nothing is specified, then all proper drivers will be tried to bind\n"
                                                      "       to all the devices without recursion. Each connection status will\n"
                                                      "       be dumped.\n"
                                                      "    7. Output redirection is not supported for 'connect -r' usage.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To connect all drivers to all devices recursively:\n"
                                                      "    Shell> connect -r\n"
                                                      "\n"
                                                      "  * To display all connections:\n"
                                                      "    Shell> connect\n"
                                                      "    ConnectController(1) : Status = Success\n"
                                                      "    ConnectController(2) : Status = Success\n"
                                                      "    ConnectController(3) : Status = Success\n"
                                                      "    ...\n"
                                                      "    ConnectController(3D) : Status = Success\n"
                                                      "\n"
                                                      "  * To connect driver 0x17 to all the devices it can manage:\n"
                                                      "    Shell> connect 17\n"
                                                      "\n"
                                                      "  * To connect all possible drivers to device 0x19:\n"
                                                      "    Shell> connect 19\n"
                                                      "\n"
                                                      "  * To connect driver 0x17 to device 0x19:\n"
                                                      "    Shell> connect 19 17\n"
                                                      "\n"
                                                      "  * To connect console devices described in the EFI Environment Variables:\n"
                                                      "    Shell> connect -c\n" 

#string STR_SHELLENV_DISCONNECT_LINE_HELP #language eng  "Disconnects one or more drivers from a device"

#string STR_SHELLENV_DISCONNECT_VERBOSE_HELP #language eng "Disconnects one or more drivers from a device.\n"
                                                      "\n"
                                                      "DISCONNECT DeviceHandle [DriverHandle [ChildHandle]]\n"
                                                      "DISCONNECT -r\n"
                                                      "\n"
                                                      "    DeviceHandle    - Device handle, always taken as hexadecimal number\n"
                                                      "    DriverHandle    - Driver handle, always taken as hexadecimal number\n"
                                                      "    ChildHandle     - Child handle of a device, always taken as hexadecimal\n"
                                                      "                      number\n"
                                                      "    -r              - Disconnect drivers from all devices\n"
                                                      "\n"
                                                      "Notes:\n"
                                                      "    1. If option '-r' is used, all drivers will be disconnected from all \n"
                                                      "       devices in the system. In this case, no other parameters are allowed to\n"
                                                      "       be used together.\n"
                                                      "    2. If no 'ChildHandle' parameter is specified, the default is to\n"
                                                      "       disconnect all child handles of the 'DeviceHandle'.\n"
                                                      "    3. If no 'DriverHandle' parameter is specified, the default is to\n"
                                                      "       disconnect 'DeviceHandle'.\n"
                                                      "    4. This command does not support output redirection.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To disconnect all drivers from all devices:\n"
                                                      "    Shell> disconnect -r\n"
                                                      "\n"
                                                      "  * To disconnect all drivers from device 0x28:\n"
                                                      "    fs0:\\> disconnect 28\n"
                                                      "\n"
                                                      "  * To disconnect driver 0x17 from device 0x28:\n"
                                                      "    fs0:\\> disconnect 28 17\n"
                                                      "\n"
                                                      "  * To disconnect driver 0x17 from controlling the child 0x32 of device 0x28\n"
                                                      "    fs0:\\> disconnect 28 17 32\n"
                                                      "\n"

#string STR_SHELLENV_RECONNECT_LINE_HELP #language eng  "Reconnects one or more drivers from a device"

#string STR_SHELLENV_RECONNECT_VERBOSE_HELP #language eng "Reconnects one or more drivers from a device.\n"
                                                      "\n"
                                                      "RECONNECT DeviceHandle [DriverHandle [ChildHandle]]\n"
                                                      "RECONNECT -r\n"
                                                      "\n"
                                                      "    DeviceHandle    - Device handle, always taken as hexadecimal number\n"
                                                      "    DriverHandle    - Driver handle, always taken as hexadecimal number\n"
                                                      "    ChildHandle     - Child handle of device, always taken as hexadecimal\n"
                                                      "                      number\n"
                                                      "    -r              - Reconnect drivers to all devices\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. This command disconnects the drivers from the controller, just like\n"
                                                      "       'DISCONNECT', but it then immediately reconnects them recursively.\n"
                                                      "    2. If option '-r' is specified, any drivers that are binding to any\n"
                                                      "       devices will be disconnected first and then connected recursively.\n"
                                                      "    3. If no 'ChildHandle' parameter is specified, all child handles of the\n"
                                                      "       specified device will be the default.\n"
                                                      "    4. If no 'DriverHandle' parameter is specified, all drivers on the\n"
                                                      "       specified device will be the default.\n"
                                                      "    5. This command is a great way to test if drivers are following the\n"
                                                      "       EFI 1.10 Driver Model.\n"
                                                      "    6. This command does not support output redirection.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To reconnect all drivers to all devices:\n"
                                                      "    Shell> reconnect -r\n"
                                                      "\n"
                                                      "  * To reconnect all drivers to device 0x28:\n"
                                                      "    fs0:\\> reconnect 28\n"
                                                      "\n"
                                                      "  * To reconnect driver 0x17 to device 0x28:\n"
                                                      "    fs0:\\> reconnect 28 17\n"
                                                      "\n"
                                                      "  * To reconnect driver 0x17 to child 0x32 of device 0x28:\n"
                                                      "    fs0:\\> reconnect 28 17 32\n"
